In [2]:
%load_ext sql
%sql mysql+mysqlconnector://root:1234@localhost/test

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql
show databases;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('dement',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('test',),
 ('uber',)]

In [5]:
%%sql
use uber;

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [9]:
%%sql
drop table rides;
CREATE TABLE rides (
    ride_id INT ,
    driver_id INT NOT NULL,
    rider_id INT ,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL,
    primary key(ride_id , rider_id)
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [12]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'NO', 'PRI', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [16]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 202, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry '1-202' for key 'rides.PRIMARY'
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(1, 101, 202, 'Chennai', 'Coimbatore', '2024-12-29 08:00:00', 500.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [15]:
%%sql 
select * from uber.rides;

 * mysql+mysqlconnector://root:***@localhost/test
2 rows affected.

[(1, 101, 201, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00')),
 (1, 101, 202, 'Chennai', 'Coimbatore', datetime.datetime(2024, 12, 29, 8, 0), Decimal('500.00'))]

In [17]:
%%sql
CREATE TABLE users (
    user_id INT PRIMARY KEY,
    email VARCHAR(100) UNIQUE
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.

[]

In [19]:
%%sql
INSERT INTO users (user_id, email)
VALUES (1, 'user1@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [20]:
%%sql
INSERT INTO users (user_id, email)
VALUES (2, 'user2@example.com');

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [21]:
%%sql
INSERT INTO users (user_id, email)
VALUES (3, NULL); 
#null is allowed in a unique but not dup value

 * mysql+mysqlconnector://root:***@localhost/test
1 rows affected.

[]

In [22]:
%%sql
INSERT INTO users (user_id, email)
VALUES (4, 'user1@example.com');
#as no duplicate allowed

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1062 (23000): Duplicate entry 'user1@example.com' for key 'users.email'
[SQL: INSERT INTO users (user_id, email)
VALUES (4, 'user1@example.com');]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [26]:
%%sql
drop table rides;
 CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT NOT NULL,
    rider_id INT  NULL,
    pickup_location VARCHAR(100) NOT NULL,
    dropoff_location VARCHAR(100) NOT NULL,
    ride_date DATETIME NOT NULL,
    fare DECIMAL(10, 2) NOT NULL
);

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.

[]

In [27]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
7 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'NO', '', None, ''),
 ('rider_id', 'int', 'YES', '', None, ''),
 ('pickup_location', 'varchar(100)', 'NO', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'NO', '', None, ''),
 ('ride_date', 'datetime', 'NO', '', None, ''),
 ('fare', 'decimal(10,2)', 'NO', '', None, '')]

In [29]:
%%sql
INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(3, 103, null, null, 'Chennai', '2024-12-29 14:00:00', 600.00);

 * mysql+mysqlconnector://root:***@localhost/test
(mysql.connector.errors.IntegrityError) 1048 (23000): Column 'pickup_location' cannot be null
[SQL: INSERT INTO rides (ride_id, driver_id, rider_id, pickup_location, dropoff_location, ride_date, fare)
VALUES
(3, 103, null, null, 'Chennai', '2024-12-29 14:00:00', 600.00);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
%%sql
#check constrain -- eg in table defn : check (fare>0) while inserting if its negative it fails

In [30]:
%%sql
drop table if exists drivers;
CREATE TABLE drivers (
    driver_id INT PRIMARY KEY,
    driver_name VARCHAR(100),
    license_number VARCHAR(50) UNIQUE
);
 
-- Creating the rides table with driver_id as a foreign key
drop table if exists rides;
CREATE TABLE rides (
    ride_id INT PRIMARY KEY,
    driver_id INT,
    pickup_location VARCHAR(100),
    dropoff_location VARCHAR(100),
    ride_date DATETIME,
    fare DECIMAL(10, 2),
    FOREIGN KEY (driver_id) REFERENCES drivers(driver_id)
);

# to delete driver first we have to delete rides , since drivers table connected to rides

 * mysql+mysqlconnector://root:***@localhost/test
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [31]:
%%sql
desc rides;

 * mysql+mysqlconnector://root:***@localhost/test
6 rows affected.

[('ride_id', 'int', 'NO', 'PRI', None, ''),
 ('driver_id', 'int', 'YES', 'MUL', None, ''),
 ('pickup_location', 'varchar(100)', 'YES', '', None, ''),
 ('dropoff_location', 'varchar(100)', 'YES', '', None, ''),
 ('ride_date', 'datetime', 'YES', '', None, ''),
 ('fare', 'decimal(10,2)', 'YES', '', None, '')]